import React, { useState } from "react";
import PageTitle from "./Heading/PageTitle";
import PageHead from "./Heading/PageHead";
import PageSubtitle from "./Heading/PageSubtitle";
import PageHeadingImage from "./Heading/HeadingImage";
import { motion } from "framer-motion";

import useIntersection from "../hooks/useIntersection";
import { Link } from "react-router-dom";

import { ChevronDownIcon } from "@heroicons/react/24/outline";

//images
import faq from "../assets/images/faq.svg";
import { Transition } from "@headlessui/react";

//data
const faqs = [
  {
    question: "কোর্সটি করার জন্য আগে থেকে কি কি জানতে হবে?",
    answer:
      "কোর্সটি করার জন্য বেসিক এইচ.টি.এম.এল, সি.এস.এস, বেসিক জাভাস্ক্রিপ্ট, মডার্ন (>ES6) জাভাস্ক্রিপ্ট, DOM, রিয়্যাক্ট জেএস, npm, Git/GitHub সম্পর্কে ধারণা এবং VSCode এডিটরে কাজ করার অভিজ্ঞতা থাকতে হবে। বিস্তারিত এখান থেকে জানুন।",
  },
  {
    question: "কোর্সের প্রথম ক্লাস কবে থেকে শুরু হবে?",
    answer:
      "কোর্সটি অন-ডিমান্ড ভিডিও অনলি কোর্স হিসেবে থাকবে এবং আপনি যেকোন সময় কিনে সাথে সাথেই ভিডিও গুলো এক্সেস করতে পারবেন। এটি কোন ব্যাচ সিস্টেম কোর্স নয়।",
  },
  {
    question: "কোর্সের ভিডিওগুলো কিভাবে দেয়া হবে?",
    answer:
      "কোর্সের ভিডিওগুলো আগে থেকে রেকোর্ডেড থাকবে। আপনি এনরোল করার পর আপনাকে দেয়া লগইন ইনফরমেশন দিয়ে লগইন করে আপনি সব ভিডিও গুলো যথা সময়ে দেখতে পারবেন।",
  },
  {
    question: "কোর্সের পরীক্ষাগুলোতে কিভাবে অংশগ্রহণ করবেন?",
    answer:
      "প্রতিটি ভিডিওর সাথে কুইজ থাকবে এবং নিজের প্রগ্রেস বুঝার জন্য আপনি কুইজগুলো প্র্যাকটিস করতে পারেন। এছাড়া প্রতিটি মডিউল শেষে একটি করে বড়/মাঝারি এসাইনমেন্ট থাকবে শুধু আপনার প্র্যাকটিস করার জন্য। আমরা কোন এসাইন্মেন্ট রিভিউ করে দিবোনা। তবে এসাইনমেন্টের বেস্ট প্র্যাকটিস নিয়ে আমাদের রেকোর্ডেড কিছু ভিডিও থাকবে এবং সল্যুশন গুলো আপনারা গিটহাব রিপোজিটরিতে পেয়ে যাবেন।",
  },
  {
    question: "কোর্সটি কতদিন চলবে?",
    answer:
      "কোর্সটি আমরা সেলফ-পেসড ভিডিও অনলি কোর্স হিসেবে রেখে দিয়েছি। আপনারা যেকোন সময় কিনতে পারবেন এবং শেখা শুরু করে দিতে পারবেন। তবে কোর্সটি এভাবে কতদিন উন্মুক্ত থাকবে সেটি আমরা বলতে পারছিনা। লার্ন উইথ সুমিত কর্তৃপক্ষ যেকোন সময় কোর্সটি বন্ধ করে দেয়ার অধিকার রাখে।",
  },
  {
    question: "কোর্স ফি কতো?",
    answer:
      "সবার প্রথমে প্রয়োজন হবে আপনার ডেডিকেটেড সময় এবং আন্তরিক পরিশ্রম ও অধ্যবসায়। যদি আপনি এগুলো দিতে না পারেন, তাহলে এই কোর্সে এনরোল করে আপনার কোন লাভ হবেনা। এছাড়া আপনার প্রয়োজন হবে একটি ল্যাপটপ বা কম্পিউটার যেখানে Google Chrome ব্রাউজার, Node.js এবং VS Code এডিটর ইন্সটল করা থাকতে হবে। এরপরে আপনার প্রয়োজন হবে কমপক্ষে ২-১০ এম.বি.পি.এস এর ইন্টারনেট কানেকশন। ব্রডব্যান্ড ইন্টারনেট কানেকশন হলে ভাল হয় তাহলে ভিডিওগুলো ভালভাবে দেখতে পারবেন। আপনি চাইলে মোবাইল ব্রাউজার থেকে ভিডিও গুলো দেখতে পারেন কিন্তু সেটা আমরা কখনোই রেকোমেন্ড করিনা কারণ শেখার সাথে সাথে আসল কোড এডিটরে কোড করা অনেক গুরুত্বপূর্ণ যেটা মোবাইল ব্রাউজারে কখনোই ভালভাবে করা হয়ে উঠেনা। এছাড়া কোর্সের আগের ব্যাচের স্টুডেন্ট কমিউনিটির সাথে সাহায্যের জন্য যুক্ত হতে চাইলে আমাদের প্রাইভেট ডিসকোর্ড চ্যানেলে আপনাকে যুক্ত হতে হবে। তাই আপনার অবশ্যই একটি ডিসকোর্ড একাউন্টের প্রয়োজন হবে এবং এনরোল করার সময় আপনার ডিসকোর্ড ইউজারনেমটি দিতে হবে যেন আমরা সেই ইউজারনেমটিকে আমাদের সাপোর্ট চ্যানেলে এক্সেস দিতে পারি।",
  },
  {
    question: "কোর্স ফি কি কোর্সের আগে একবারে পুরোটা পরিশোধ করতে হবে",
    answer:
      "হ্যাঁ। কোর্স ফি এককালীন একবারে পুরোটাই কোর্সের শুরুতে পরিশোধ করে দিতে হবে। শুধুমাত্র কোর্স ফি পরিশোধ করার পরই আপনাদের কে লগইন ইনফরমেশন দেয়া হবে। কোন ভাবেই কোর্স ফি বাকি রাখা অথবা এসম্পর্কিত অনুরোধ গৃহীত হবেনা।",
  },
  {
    question: "কোর্স ফি কি ফেরতযোগ্য?",
    answer:
      "এনরোলমেন্ট করার সর্বোচ্চ 7 দিনের মধ্যে আপনি আমাদের ওয়েবসাইট থেকে উপযুক্ত কারণ জানিয়ে কোর্স ফি রিফান্ড রিকুয়েস্ট করতে পারবেন। আপনার কোর্স রিফান্ড রিকুয়েস্টটি সফল হবার পর আপনি কোর্সের সমস্ত এক্সেস হারাবেন এবং আমাদের প্লাটফর্মে আর লগইন করতে পারবেন না।",
  },
  {
    question: "কোর্স ফি তে কি কোন ডিসকাউন্ট দেয়া হবে?",
    answer:
      "না। যেহেতু আমরা নামমাত্র কোর্স ফি নির্ধারণ করেছি, তাই আমাদের কোর্স ফি তে আমরা কোন ধরণের ডিসকাউন্ট দিচ্ছিনা এবং এব্যাপারে কোন অনুরোধও আমরা গ্রহণ করছিনা। এজন্য আমরা আন্তরিকভাবে দুঃখিত।",
  },
  {
    question: "কোর্স ফি কিভাবে পরিশোধ করবো?",
    answer:
      "আপনি বিকাশ/SSLCOMMERZ অনলাইন পেমেন্ট গেটওয়ের মাধ্যমে কোর্স ফি পরিশোধ করতে পারবেন। আপনি যদি বিকাশ অ্যাপ এর মাধ্যমে ম্যনুয়ালি কোর্স ফি পে করতে চান, তাহলে বিকাশ অ্যাপটি ওপেন করে  বাটনে ক্লিক করে সরাসরি আমাদের বিকাশ নাম্বার - 01979985368 টাইপ করে পে করতে পারেন অথবা আমাদের ওয়েবসাইটের 'পেমেন্ট করুন' সেকশনে দেয়া QR কোডটি স্ক্যান করেও দ্রুত পেমেন্ট করে ফেলতে পারেন। মোবাইল নাম্বার ম্যানুয়ালি টাইপ করে পেমেন্ট করতে যাবার সময় ভাল করে দেখে নিবেন মার্চেন্ট নামের জায়গায় 'Learn with Sumit - LWS' এবং লার্ন উইথ সুমিত - এর ব্র্যান্ড লোগো দেখতে পাচ্ছেন কিনা। আপনি বিকাশ অ্যাপ ইউজার না হলে সরাসরি ম্যানুয়াল বিকাশ করার মাধ্যমেও আমাদের কে পে করতে পারবেন",
  },
  {
    question: "কোর্স ফি দিতে পারছিনা। কি করবো?",
    answer:
      "পেমেন্ট সংক্রান্ত যেকোন জটিলতার জন্য কোন রকম দ্বিধা না করে সরাসরি আমাদের সাপোর্ট সেন্টারে কল করুন। আমাদের সাপোর্ট টিম আপ্রাণ চেষ্টা করবে আপনার সমস্যাটি সমাধান করার।",
  },
  {
    question: "এই কোর্স কি চাকরির নিশ্চয়তা দিতে পারবে?",
    answer:
      "এই পৃথিবীতে কোন কিছুই নিশ্চিত নয় তাই আমরাও এই একটি কোর্সের মাধ্যমে আপনাকে চাকরির নিশ্চয়তা দিতে পারছিনা। আপনি চাকরি পাবেন কিনা সেটা নির্ভর করবে আপনার কঠোর পরিশ্রম, অধ্যবসায় এবং স্কিল সেট এর উপরে। এই কোর্সটি আপনাকে রিডাক্সের জটিল বিষয়গুলোকে সহজ ভাবে বুঝাতে সাহায্য করবে, একটি সঠিক গাইডলাইন দিবে এবং সেই সাথে আপনাকে একটি লার্নিং প্রসেস এর মধ্যে নিয়ে আসবে। শুধু তাই নয়, এই কোর্সের বিভিন্ন কুইজ, এসাইনমেন্ট এবং পরীক্ষা গুলোতে সিরিয়াসভাবে অংশগ্রহণ করলে কোর্স শেষে আপনি একটি আত্মবিশ্বাস পাবেন যা আপনাকে চাকরির ইন্টারভিউতে ভাল করতে সাহায্য করবে বলে আমাদের বিশ্বাস।",
  },
];

function Section7() {
  const [show, setShow] = useState(null);

  const [ref, visible] = useIntersection({ threshold: 0.1 });

  const toggle = (index) => {
    if (index === show) {
      setShow(100);
    } else {
      setShow(index);
    }
  };

  return (
    <section
      id="faq"
      ref={ref}
      className="w-full relative py-24 bg-slate-100  border-gray-300  gradient-primary dark:border-gray-400/50 wrapper gradient-primary border-general  border-t dark:bg-slate-900 dark:bg-none  border-b border-b-slate-300/50"
    >
      <div className="container w-[90%] mx-auto ">
        <div className="flex  flex-col gap-20 lg:flex-row ">
          <PageTitle className=" !justify-start !items-start !gap-4 lg:flex-[4]">
            <PageHeadingImage src={faq} visible={true} />
            <PageHead className="!text-left">
              সচরাচর জানতে চাওয়া <br />
              <span className="primary-highlighter ">প্রশ্নের উত্তর</span>
            </PageHead>
            <PageSubtitle className="text-[16px] !font-light dark:text-slate-300 !text-left">
              আপনাদের কমন কিছু প্রশ্নের উত্তর আমরা এখানে লিস্ট করে দিয়েছি।
              আমাদের কে প্রশ্ন করার পূর্বে এই লিস্টটি একবার পড়ে নেয়ার অনুরোধ
              থাকলো। তাহলে আমাদের উত্তরের জন্য আপনাকে অপেক্ষা করতে হবেনা এবং
              আপনার মূল্যবান সময় বেঁচে যাবে।
            </PageSubtitle>
          </PageTitle>

          <div className="faqs h-[27rem] overflow-y-scroll scrollbar  lg:flex-[6]">
            {faqs.map((faq, index) => {
              return (
                <div
                  key={index}
                  className={`faq border-b border-slate-300 overflow-hidden   m-1`}
                >
                  <button
                    onClick={() => toggle(index)}
                    className=" transition  duration-200 hover:bg-violet-700 focus:bg-violet-700 p-4  hover:text-white focus:text-white font-semibold flex  justify-between items-center w-full text-slate-700/90  text-[16px]"
                  >
                    <h2 className="text-left dark:text-slate-300">
                      {faq.question}
                    </h2>
                    <ChevronDownIcon
                      className={`w-4 h-4  ${
                        index === show ? "rotate-180" : "rotate-0"
                      }`}
                      strokeWidth="3"
                    />
                  </button>

                  <p
                  
                    
                    className={` dark:text-slate-400   ${
                      show === index
                        ? " transition-opacity duration-700 px-4 py-2 pb-6   block opacity-100 "
                        : "hidden opacity-0"
                    }`}
                  >
                    {faq.answer}
                  </p>
                </div>
              );
            })}
          </div>
        </div>
      </div>
    </section>
  );
}

export default Section7;
